SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0180/MM32L0180_Bootloader/Device/MM32L0180/Include/reg_dma.h
/***********************************************************************************************************************
    @file     reg_dma.h
    @author   VV TEAM
    @brief    This flie contains all the DMA's register and its field definition.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef __REG_DMA_H
#define __REG_DMA_H

/* Files includes ----------------------------------------------------------------------------------------------------*/
#include <core_cm0plus.h>



/**
  * @brief DMA Base Address Definition
  */
#define  DMA_BASE                                  0x40020000                                       /*!<Base Address: 0x40020000*/
#define  DMA_Channel1_BASE                         (DMA_BASE     + 0x0008U)                         /*!<Base Address: (DMA_BASE     + 0x0008U)*/
#define  DMA_Channel2_BASE                         (DMA_BASE     + 0x001CU)                         /*!<Base Address: (DMA_BASE     + 0x001CU)*/
#define  DMA_Channel3_BASE                         (DMA_BASE     + 0x0030U)                         /*!<Base Address: (DMA_BASE     + 0x0030U)*/

/**
  * @brief DMA Register Structure Definition
  */
typedef struct
{
    __IO uint32_t ISR;                            /*!<DMA DMA interrupt status register              offset: 0x00       */
    __IO uint32_t IFCR;                           /*!<DMA DMA interrupt flag clear register          offset: 0x04       */
    __IO uint32_t RESERVED0x08[42];               /*!<                                               offset: 0x08~0xAC  */
    __IO uint32_t CHSEL0;                         /*!<DMA DMAMUX channel selection register 0        offset: 0xB0       */
    __IO uint32_t CHSEL1;                         /*!<DMA DMAMUX channel selection register 1        offset: 0xB4       */
} DMA_TypeDef;

/**
  * @brief DMA_Channel Register Structure Definition
  */
typedef struct
{
    __IO uint32_t CCR;                            /*!<DMA DMA channel x configuration register       offset: 0x00       */
    __IO uint32_t CNDTR;                          /*!<DMA DMA channel x number of data register      offset: 0x04       */
    __IO uint32_t CPAR;                           /*!<DMA DMA channel x peripheral address register  offset: 0x08       */
    __IO uint32_t CMAR;                           /*!<DMA DMA channel x memory address register      offset: 0x0C       */
} DMA_Channel_TypeDef;

/**
  * @brief DMA type pointer Definition
  */
#define DMA                                       ((DMA_TypeDef *)DMA_BASE)
#define DMA_Channel1                              ((DMA_Channel_TypeDef *)DMA_Channel1_BASE)
#define DMA_Channel2                              ((DMA_Channel_TypeDef *)DMA_Channel2_BASE)
#define DMA_Channel3                              ((DMA_Channel_TypeDef *)DMA_Channel3_BASE)

/**
  * @brief DMA_ISR Register Bit Definition
  */
#define  DMA_ISR_GIF1_Pos                         (0)
#define  DMA_ISR_GIF1_Msk                         (0x1U << DMA_ISR_GIF1_Pos)                        /*!<global interrupt flag*/
#define  DMA_ISR_GIF1                             DMA_ISR_GIF1_Msk
#define  DMA_ISR_TCIF1_Pos                        (1)
#define  DMA_ISR_TCIF1_Msk                        (0x1U << DMA_ISR_TCIF1_Pos)                       /*!<transfer complete flag*/
#define  DMA_ISR_TCIF1                            DMA_ISR_TCIF1_Msk
#define  DMA_ISR_HTIF1_Pos                        (2)
#define  DMA_ISR_HTIF1_Msk                        (0x1U << DMA_ISR_HTIF1_Pos)                       /*!<half transfer flag*/
#define  DMA_ISR_HTIF1                            DMA_ISR_HTIF1_Msk
#define  DMA_ISR_TEIF1_Pos                        (3)
#define  DMA_ISR_TEIF1_Msk                        (0x1U << DMA_ISR_TEIF1_Pos)                       /*!<transfer error flag*/
#define  DMA_ISR_TEIF1                            DMA_ISR_TEIF1_Msk
#define  DMA_ISR_GIF2_Pos                         (4)
#define  DMA_ISR_GIF2_Msk                         (0x1U << DMA_ISR_GIF2_Pos)                        /*!<global interrupt flag*/
#define  DMA_ISR_GIF2                             DMA_ISR_GIF2_Msk
#define  DMA_ISR_TCIF2_Pos                        (5)
#define  DMA_ISR_TCIF2_Msk                        (0x1U << DMA_ISR_TCIF2_Pos)                       /*!<transfer complete flag*/
#define  DMA_ISR_TCIF2                            DMA_ISR_TCIF2_Msk
#define  DMA_ISR_HTIF2_Pos                        (6)
#define  DMA_ISR_HTIF2_Msk                        (0x1U << DMA_ISR_HTIF2_Pos)                       /*!<half transfer flag*/
#define  DMA_ISR_HTIF2                            DMA_ISR_HTIF2_Msk
#define  DMA_ISR_TEIF2_Pos                        (7)
#define  DMA_ISR_TEIF2_Msk                        (0x1U << DMA_ISR_TEIF2_Pos)                       /*!<transfer error flag*/
#define  DMA_ISR_TEIF2                            DMA_ISR_TEIF2_Msk
#define  DMA_ISR_GIF3_Pos                         (8)
#define  DMA_ISR_GIF3_Msk                         (0x1U << DMA_ISR_GIF3_Pos)                        /*!<global interrupt flag*/
#define  DMA_ISR_GIF3                             DMA_ISR_GIF3_Msk
#define  DMA_ISR_TCIF3_Pos                        (9)
#define  DMA_ISR_TCIF3_Msk                        (0x1U << DMA_ISR_TCIF3_Pos)                       /*!<transfer complete flag*/
#define  DMA_ISR_TCIF3                            DMA_ISR_TCIF3_Msk
#define  DMA_ISR_HTIF3_Pos                        (10)
#define  DMA_ISR_HTIF3_Msk                        (0x1U << DMA_ISR_HTIF3_Pos)                       /*!<half transfer flag*/
#define  DMA_ISR_HTIF3                            DMA_ISR_HTIF3_Msk
#define  DMA_ISR_TEIF3_Pos                        (11)
#define  DMA_ISR_TEIF3_Msk                        (0x1U << DMA_ISR_TEIF3_Pos)                       /*!<transfer error flag*/
#define  DMA_ISR_TEIF3                            DMA_ISR_TEIF3_Msk

/**
  * @brief DMA_IFCR Register Bit Definition
  */
#define  DMA_IFCR_CGIF1_Pos                       (0)
#define  DMA_IFCR_CGIF1_Msk                       (0x1U << DMA_IFCR_CGIF1_Pos)                      /*!<global interrupt clear*/
#define  DMA_IFCR_CGIF1                           DMA_IFCR_CGIF1_Msk
#define  DMA_IFCR_CTCIF1_Pos                      (1)
#define  DMA_IFCR_CTCIF1_Msk                      (0x1U << DMA_IFCR_CTCIF1_Pos)                     /*!<transfer complete clear*/
#define  DMA_IFCR_CTCIF1                          DMA_IFCR_CTCIF1_Msk
#define  DMA_IFCR_CHTIF1_Pos                      (2)
#define  DMA_IFCR_CHTIF1_Msk                      (0x1U << DMA_IFCR_CHTIF1_Pos)                     /*!<half transfer clear*/
#define  DMA_IFCR_CHTIF1                          DMA_IFCR_CHTIF1_Msk
#define  DMA_IFCR_CTEIF1_Pos                      (3)
#define  DMA_IFCR_CTEIF1_Msk                      (0x1U << DMA_IFCR_CTEIF1_Pos)                     /*!<transfer error clear*/
#define  DMA_IFCR_CTEIF1                          DMA_IFCR_CTEIF1_Msk
#define  DMA_IFCR_CGIF2_Pos                       (4)
#define  DMA_IFCR_CGIF2_Msk                       (0x1U << DMA_IFCR_CGIF2_Pos)                      /*!<global interrupt clear*/
#define  DMA_IFCR_CGIF2                           DMA_IFCR_CGIF2_Msk
#define  DMA_IFCR_CTCIF2_Pos                      (5)
#define  DMA_IFCR_CTCIF2_Msk                      (0x1U << DMA_IFCR_CTCIF2_Pos)                     /*!<transfer complete clear*/
#define  DMA_IFCR_CTCIF2                          DMA_IFCR_CTCIF2_Msk
#define  DMA_IFCR_CHTIF2_Pos                      (6)
#define  DMA_IFCR_CHTIF2_Msk                      (0x1U << DMA_IFCR_CHTIF2_Pos)                     /*!<half transfer clear*/
#define  DMA_IFCR_CHTIF2                          DMA_IFCR_CHTIF2_Msk
#define  DMA_IFCR_CTEIF2_Pos                      (7)
#define  DMA_IFCR_CTEIF2_Msk                      (0x1U << DMA_IFCR_CTEIF2_Pos)                     /*!<transfer error clear*/
#define  DMA_IFCR_CTEIF2                          DMA_IFCR_CTEIF2_Msk
#define  DMA_IFCR_CGIF3_Pos                       (8)
#define  DMA_IFCR_CGIF3_Msk                       (0x1U << DMA_IFCR_CGIF3_Pos)                      /*!<global interrupt clear*/
#define  DMA_IFCR_CGIF3                           DMA_IFCR_CGIF3_Msk
#define  DMA_IFCR_CTCIF3_Pos                      (9)
#define  DMA_IFCR_CTCIF3_Msk                      (0x1U << DMA_IFCR_CTCIF3_Pos)                     /*!<transfer complete clear*/
#define  DMA_IFCR_CTCIF3                          DMA_IFCR_CTCIF3_Msk
#define  DMA_IFCR_CHTIF3_Pos                      (10)
#define  DMA_IFCR_CHTIF3_Msk                      (0x1U << DMA_IFCR_CHTIF3_Pos)                     /*!<half transfer clear*/
#define  DMA_IFCR_CHTIF3                          DMA_IFCR_CHTIF3_Msk
#define  DMA_IFCR_CTEIF3_Pos                      (11)
#define  DMA_IFCR_CTEIF3_Msk                      (0x1U << DMA_IFCR_CTEIF3_Pos)                     /*!<transfer error clear*/
#define  DMA_IFCR_CTEIF3                          DMA_IFCR_CTEIF3_Msk

/**
  * @brief DMA_CHSEL0 Register Bit Definition
  */
#define  DMA_CHSEL0_CH1SEL_Pos                    (0)
#define  DMA_CHSEL0_CH1SEL_Msk                    (0xFFU << DMA_CHSEL0_CH1SEL_Pos)                  /*!<For Channel1 trigger source selection, see the DMAMUX documentation*/
#define  DMA_CHSEL0_CH1SEL                        DMA_CHSEL0_CH1SEL_Msk
#define  DMA_CHSEL0_CH1SEL_0                      (0x01U << DMA_CHSEL0_CH1SEL_Pos) 
#define  DMA_CHSEL0_CH1SEL_1                      (0x02U << DMA_CHSEL0_CH1SEL_Pos) 
#define  DMA_CHSEL0_CH1SEL_2                      (0x04U << DMA_CHSEL0_CH1SEL_Pos) 
#define  DMA_CHSEL0_CH1SEL_3                      (0x08U << DMA_CHSEL0_CH1SEL_Pos) 
#define  DMA_CHSEL0_CH1SEL_4                      (0x10U << DMA_CHSEL0_CH1SEL_Pos) 
#define  DMA_CHSEL0_CH1SEL_5                      (0x20U << DMA_CHSEL0_CH1SEL_Pos) 
#define  DMA_CHSEL0_CH1SEL_6                      (0x40U << DMA_CHSEL0_CH1SEL_Pos) 
#define  DMA_CHSEL0_CH1SEL_7                      (0x80U << DMA_CHSEL0_CH1SEL_Pos) 
#define  DMA_CHSEL0_CH2SEL_Pos                    (8)
#define  DMA_CHSEL0_CH2SEL_Msk                    (0xFFU << DMA_CHSEL0_CH2SEL_Pos)                  /*!<For Channel2 trigger source selection, see the DMAMUX documentation*/
#define  DMA_CHSEL0_CH2SEL                        DMA_CHSEL0_CH2SEL_Msk
#define  DMA_CHSEL0_CH2SEL_0                      (0x01U << DMA_CHSEL0_CH2SEL_Pos) 
#define  DMA_CHSEL0_CH2SEL_1                      (0x02U << DMA_CHSEL0_CH2SEL_Pos) 
#define  DMA_CHSEL0_CH2SEL_2                      (0x04U << DMA_CHSEL0_CH2SEL_Pos) 
#define  DMA_CHSEL0_CH2SEL_3                      (0x08U << DMA_CHSEL0_CH2SEL_Pos) 
#define  DMA_CHSEL0_CH2SEL_4                      (0x10U << DMA_CHSEL0_CH2SEL_Pos) 
#define  DMA_CHSEL0_CH2SEL_5                      (0x20U << DMA_CHSEL0_CH2SEL_Pos) 
#define  DMA_CHSEL0_CH2SEL_6                      (0x40U << DMA_CHSEL0_CH2SEL_Pos) 
#define  DMA_CHSEL0_CH2SEL_7                      (0x80U << DMA_CHSEL0_CH2SEL_Pos) 
#define  DMA_CHSEL0_CH3SEL_Pos                    (16)
#define  DMA_CHSEL0_CH3SEL_Msk                    (0xFFU << DMA_CHSEL0_CH3SEL_Pos)                  /*!<For Channel3 trigger source selection, see the DMAMUX documentation*/
#define  DMA_CHSEL0_CH3SEL                        DMA_CHSEL0_CH3SEL_Msk
#define  DMA_CHSEL0_CH3SEL_0                      (0x01U << DMA_CHSEL0_CH3SEL_Pos) 
#define  DMA_CHSEL0_CH3SEL_1                      (0x02U << DMA_CHSEL0_CH3SEL_Pos) 
#define  DMA_CHSEL0_CH3SEL_2                      (0x04U << DMA_CHSEL0_CH3SEL_Pos) 
#define  DMA_CHSEL0_CH3SEL_3                      (0x08U << DMA_CHSEL0_CH3SEL_Pos) 
#define  DMA_CHSEL0_CH3SEL_4                      (0x10U << DMA_CHSEL0_CH3SEL_Pos) 
#define  DMA_CHSEL0_CH3SEL_5                      (0x20U << DMA_CHSEL0_CH3SEL_Pos) 
#define  DMA_CHSEL0_CH3SEL_6                      (0x40U << DMA_CHSEL0_CH3SEL_Pos) 
#define  DMA_CHSEL0_CH3SEL_7                      (0x80U << DMA_CHSEL0_CH3SEL_Pos) 
#define  DMA_CHSEL0_CH4SEL_Pos                    (24)
#define  DMA_CHSEL0_CH4SEL_Msk                    (0xFFU << DMA_CHSEL0_CH4SEL_Pos)                  /*!<For Channel4 trigger source selection, see the DMAMUX documentation*/
#define  DMA_CHSEL0_CH4SEL                        DMA_CHSEL0_CH4SEL_Msk
#define  DMA_CHSEL0_CH4SEL_0                      (0x01U << DMA_CHSEL0_CH4SEL_Pos) 
#define  DMA_CHSEL0_CH4SEL_1                      (0x02U << DMA_CHSEL0_CH4SEL_Pos) 
#define  DMA_CHSEL0_CH4SEL_2                      (0x04U << DMA_CHSEL0_CH4SEL_Pos) 
#define  DMA_CHSEL0_CH4SEL_3                      (0x08U << DMA_CHSEL0_CH4SEL_Pos) 
#define  DMA_CHSEL0_CH4SEL_4                      (0x10U << DMA_CHSEL0_CH4SEL_Pos) 
#define  DMA_CHSEL0_CH4SEL_5                      (0x20U << DMA_CHSEL0_CH4SEL_Pos) 
#define  DMA_CHSEL0_CH4SEL_6                      (0x40U << DMA_CHSEL0_CH4SEL_Pos) 
#define  DMA_CHSEL0_CH4SEL_7                      (0x80U << DMA_CHSEL0_CH4SEL_Pos) 

/**
  * @brief DMA_CHSEL1 Register Bit Definition
  */
#define  DMA_CHSEL1_CH5SEL_Pos                    (0)
#define  DMA_CHSEL1_CH5SEL_Msk                    (0xFFU << DMA_CHSEL1_CH5SEL_Pos)                  /*!<For Channel5 trigger source selection, see the DMAMUX documentation*/
#define  DMA_CHSEL1_CH5SEL                        DMA_CHSEL1_CH5SEL_Msk
#define  DMA_CHSEL1_CH5SEL_0                      (0x01U << DMA_CHSEL1_CH5SEL_Pos) 
#define  DMA_CHSEL1_CH5SEL_1                      (0x02U << DMA_CHSEL1_CH5SEL_Pos) 
#define  DMA_CHSEL1_CH5SEL_2                      (0x04U << DMA_CHSEL1_CH5SEL_Pos) 
#define  DMA_CHSEL1_CH5SEL_3                      (0x08U << DMA_CHSEL1_CH5SEL_Pos) 
#define  DMA_CHSEL1_CH5SEL_4                      (0x10U << DMA_CHSEL1_CH5SEL_Pos) 
#define  DMA_CHSEL1_CH5SEL_5                      (0x20U << DMA_CHSEL1_CH5SEL_Pos) 
#define  DMA_CHSEL1_CH5SEL_6                      (0x40U << DMA_CHSEL1_CH5SEL_Pos) 
#define  DMA_CHSEL1_CH5SEL_7                      (0x80U << DMA_CHSEL1_CH5SEL_Pos) 
#define  DMA_CHSEL1_CH6SEL_Pos                    (8)
#define  DMA_CHSEL1_CH6SEL_Msk                    (0xFFU << DMA_CHSEL1_CH6SEL_Pos)                  /*!<For Channel6 trigger source selection, see the DMAMUX documentation*/
#define  DMA_CHSEL1_CH6SEL                        DMA_CHSEL1_CH6SEL_Msk
#define  DMA_CHSEL1_CH6SEL_0                      (0x01U << DMA_CHSEL1_CH6SEL_Pos) 
#define  DMA_CHSEL1_CH6SEL_1                      (0x02U << DMA_CHSEL1_CH6SEL_Pos) 
#define  DMA_CHSEL1_CH6SEL_2                      (0x04U << DMA_CHSEL1_CH6SEL_Pos) 
#define  DMA_CHSEL1_CH6SEL_3                      (0x08U << DMA_CHSEL1_CH6SEL_Pos) 
#define  DMA_CHSEL1_CH6SEL_4                      (0x10U << DMA_CHSEL1_CH6SEL_Pos) 
#define  DMA_CHSEL1_CH6SEL_5                      (0x20U << DMA_CHSEL1_CH6SEL_Pos) 
#define  DMA_CHSEL1_CH6SEL_6                      (0x40U << DMA_CHSEL1_CH6SEL_Pos) 
#define  DMA_CHSEL1_CH6SEL_7                      (0x80U << DMA_CHSEL1_CH6SEL_Pos) 
#define  DMA_CHSEL1_CH7SEL_Pos                    (16)
#define  DMA_CHSEL1_CH7SEL_Msk                    (0xFFU << DMA_CHSEL1_CH7SEL_Pos)                  /*!<For Channel7 trigger source selection, see the DMAMUX documentation*/
#define  DMA_CHSEL1_CH7SEL                        DMA_CHSEL1_CH7SEL_Msk
#define  DMA_CHSEL1_CH7SEL_0                      (0x01U << DMA_CHSEL1_CH7SEL_Pos) 
#define  DMA_CHSEL1_CH7SEL_1                      (0x02U << DMA_CHSEL1_CH7SEL_Pos) 
#define  DMA_CHSEL1_CH7SEL_2                      (0x04U << DMA_CHSEL1_CH7SEL_Pos) 
#define  DMA_CHSEL1_CH7SEL_3                      (0x08U << DMA_CHSEL1_CH7SEL_Pos) 
#define  DMA_CHSEL1_CH7SEL_4                      (0x10U << DMA_CHSEL1_CH7SEL_Pos) 
#define  DMA_CHSEL1_CH7SEL_5                      (0x20U << DMA_CHSEL1_CH7SEL_Pos) 
#define  DMA_CHSEL1_CH7SEL_6                      (0x40U << DMA_CHSEL1_CH7SEL_Pos) 
#define  DMA_CHSEL1_CH7SEL_7                      (0x80U << DMA_CHSEL1_CH7SEL_Pos) 
#define  DMA_CHSEL1_CH8SEL_Pos                    (24)
#define  DMA_CHSEL1_CH8SEL_Msk                    (0xFFU << DMA_CHSEL1_CH8SEL_Pos)                  /*!<For Channel8 trigger source selection, see the DMAMUX documentation*/
#define  DMA_CHSEL1_CH8SEL                        DMA_CHSEL1_CH8SEL_Msk
#define  DMA_CHSEL1_CH8SEL_0                      (0x01U << DMA_CHSEL1_CH8SEL_Pos) 
#define  DMA_CHSEL1_CH8SEL_1                      (0x02U << DMA_CHSEL1_CH8SEL_Pos) 
#define  DMA_CHSEL1_CH8SEL_2                      (0x04U << DMA_CHSEL1_CH8SEL_Pos) 
#define  DMA_CHSEL1_CH8SEL_3                      (0x08U << DMA_CHSEL1_CH8SEL_Pos) 
#define  DMA_CHSEL1_CH8SEL_4                      (0x10U << DMA_CHSEL1_CH8SEL_Pos) 
#define  DMA_CHSEL1_CH8SEL_5                      (0x20U << DMA_CHSEL1_CH8SEL_Pos) 
#define  DMA_CHSEL1_CH8SEL_6                      (0x40U << DMA_CHSEL1_CH8SEL_Pos) 
#define  DMA_CHSEL1_CH8SEL_7                      (0x80U << DMA_CHSEL1_CH8SEL_Pos) 

/**
  * @brief DMA_CCR Register Bit Definition
  */
#define  DMA_CCR_EN_Pos                           (0)
#define  DMA_CCR_EN_Msk                           (0x1U << DMA_CCR_EN_Pos)                          /*!<Channel enable*/
#define  DMA_CCR_EN                               DMA_CCR_EN_Msk
#define  DMA_CCR_TCIE_Pos                         (1)
#define  DMA_CCR_TCIE_Msk                         (0x1U << DMA_CCR_TCIE_Pos)                        /*!<Transfer complete interrupt enable*/
#define  DMA_CCR_TCIE                             DMA_CCR_TCIE_Msk
#define  DMA_CCR_HTIE_Pos                         (2)
#define  DMA_CCR_HTIE_Msk                         (0x1U << DMA_CCR_HTIE_Pos)                        /*!<Half transfer interrupt enable*/
#define  DMA_CCR_HTIE                             DMA_CCR_HTIE_Msk
#define  DMA_CCR_TEIE_Pos                         (3)
#define  DMA_CCR_TEIE_Msk                         (0x1U << DMA_CCR_TEIE_Pos)                        /*!<Transfer error interrupt enable*/
#define  DMA_CCR_TEIE                             DMA_CCR_TEIE_Msk
#define  DMA_CCR_DIR_Pos                          (4)
#define  DMA_CCR_DIR_Msk                          (0x1U << DMA_CCR_DIR_Pos)                         /*!<Data transfer direction*/
#define  DMA_CCR_DIR                              DMA_CCR_DIR_Msk
#define  DMA_CCR_CIRC_Pos                         (5)
#define  DMA_CCR_CIRC_Msk                         (0x1U << DMA_CCR_CIRC_Pos)                        /*!<Circular mode*/
#define  DMA_CCR_CIRC                             DMA_CCR_CIRC_Msk
#define  DMA_CCR_PINC_Pos                         (6)
#define  DMA_CCR_PINC_Msk                         (0x1U << DMA_CCR_PINC_Pos)                        /*!<Peripheral increment mode*/
#define  DMA_CCR_PINC                             DMA_CCR_PINC_Msk
#define  DMA_CCR_MINC_Pos                         (7)
#define  DMA_CCR_MINC_Msk                         (0x1U << DMA_CCR_MINC_Pos)                        /*!<Memory increment mode*/
#define  DMA_CCR_MINC                             DMA_CCR_MINC_Msk
#define  DMA_CCR_PSIZE_Pos                        (8)
#define  DMA_CCR_PSIZE_Msk                        (0x3U << DMA_CCR_PSIZE_Pos)                       /*!<Peripheral size*/
#define  DMA_CCR_PSIZE                            DMA_CCR_PSIZE_Msk
#define  DMA_CCR_PSIZE_0                          (0x1U << DMA_CCR_PSIZE_Pos) 
#define  DMA_CCR_PSIZE_1                          (0x2U << DMA_CCR_PSIZE_Pos) 
#define  DMA_CCR_MSIZE_Pos                        (10)
#define  DMA_CCR_MSIZE_Msk                        (0x3U << DMA_CCR_MSIZE_Pos)                       /*!<Memory size*/
#define  DMA_CCR_MSIZE                            DMA_CCR_MSIZE_Msk
#define  DMA_CCR_MSIZE_0                          (0x1U << DMA_CCR_MSIZE_Pos) 
#define  DMA_CCR_MSIZE_1                          (0x2U << DMA_CCR_MSIZE_Pos) 
#define  DMA_CCR_PL_Pos                           (12)
#define  DMA_CCR_PL_Msk                           (0x3U << DMA_CCR_PL_Pos)                          /*!<Channel priority level*/
#define  DMA_CCR_PL                               DMA_CCR_PL_Msk
#define  DMA_CCR_PL_0                             (0x1U << DMA_CCR_PL_Pos) 
#define  DMA_CCR_PL_1                             (0x2U << DMA_CCR_PL_Pos) 
#define  DMA_CCR_MEM2MEM_Pos                      (14)
#define  DMA_CCR_MEM2MEM_Msk                      (0x1U << DMA_CCR_MEM2MEM_Pos)                     /*!<Memory to memory mode*/
#define  DMA_CCR_MEM2MEM                          DMA_CCR_MEM2MEM_Msk
#define  DMA_CCR_ARE_Pos                          (15)
#define  DMA_CCR_ARE_Msk                          (0x1U << DMA_CCR_ARE_Pos)                         /*!<Auto reload*/
#define  DMA_CCR_ARE                              DMA_CCR_ARE_Msk

