SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32L0180/MM32L0180_Bootloader/Device/MM32L0180/Include/reg_dma.h
/**
  * @brief DMA_CNDTR Register Bit Definition
  */
#define  DMA_CNDTR_NDT_Pos                        (0)
#define  DMA_CNDTR_NDT_Msk                        (0xFFFFU << DMA_CNDTR_NDT_Pos)                    /*!<Number of data to transfer*/
#define  DMA_CNDTR_NDT                            DMA_CNDTR_NDT_Msk
#define  DMA_CNDTR_NDT_0                          (0x0001U << DMA_CNDTR_NDT_Pos) 
#define  DMA_CNDTR_NDT_1                          (0x0002U << DMA_CNDTR_NDT_Pos) 
#define  DMA_CNDTR_NDT_2                          (0x0004U << DMA_CNDTR_NDT_Pos) 
#define  DMA_CNDTR_NDT_3                          (0x0008U << DMA_CNDTR_NDT_Pos) 
#define  DMA_CNDTR_NDT_4                          (0x0010U << DMA_CNDTR_NDT_Pos) 
#define  DMA_CNDTR_NDT_5                          (0x0020U << DMA_CNDTR_NDT_Pos) 
#define  DMA_CNDTR_NDT_6                          (0x0040U << DMA_CNDTR_NDT_Pos) 
#define  DMA_CNDTR_NDT_7                          (0x0080U << DMA_CNDTR_NDT_Pos) 
#define  DMA_CNDTR_NDT_8                          (0x0100U << DMA_CNDTR_NDT_Pos) 
#define  DMA_CNDTR_NDT_9                          (0x0200U << DMA_CNDTR_NDT_Pos) 
#define  DMA_CNDTR_NDT_10                         (0x0400U << DMA_CNDTR_NDT_Pos) 
#define  DMA_CNDTR_NDT_11                         (0x0800U << DMA_CNDTR_NDT_Pos) 
#define  DMA_CNDTR_NDT_12                         (0x1000U << DMA_CNDTR_NDT_Pos) 
#define  DMA_CNDTR_NDT_13                         (0x2000U << DMA_CNDTR_NDT_Pos) 
#define  DMA_CNDTR_NDT_14                         (0x4000U << DMA_CNDTR_NDT_Pos) 
#define  DMA_CNDTR_NDT_15                         (0x8000U << DMA_CNDTR_NDT_Pos) 

/**
  * @brief DMA_CPAR Register Bit Definition
  */
#define  DMA_CPAR_PA_Pos                          (0)
#define  DMA_CPAR_PA_Msk                          (0xFFFFFFFFU << DMA_CPAR_PA_Pos)                  /*!<Peripheral address*/
#define  DMA_CPAR_PA                              DMA_CPAR_PA_Msk
#define  DMA_CPAR_PA_0                            (0x00000001U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_1                            (0x00000002U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_2                            (0x00000004U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_3                            (0x00000008U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_4                            (0x00000010U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_5                            (0x00000020U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_6                            (0x00000040U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_7                            (0x00000080U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_8                            (0x00000100U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_9                            (0x00000200U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_10                           (0x00000400U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_11                           (0x00000800U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_12                           (0x00001000U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_13                           (0x00002000U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_14                           (0x00004000U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_15                           (0x00008000U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_16                           (0x00010000U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_17                           (0x00020000U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_18                           (0x00040000U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_19                           (0x00080000U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_20                           (0x00100000U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_21                           (0x00200000U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_22                           (0x00400000U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_23                           (0x00800000U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_24                           (0x01000000U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_25                           (0x02000000U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_26                           (0x04000000U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_27                           (0x08000000U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_28                           (0x10000000U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_29                           (0x20000000U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_30                           (0x40000000U << DMA_CPAR_PA_Pos) 
#define  DMA_CPAR_PA_31                           (0x80000000U << DMA_CPAR_PA_Pos) 

/**
  * @brief DMA_CMAR Register Bit Definition
  */
#define  DMA_CMAR_MA_Pos                          (0)
#define  DMA_CMAR_MA_Msk                          (0xFFFFFFFFU << DMA_CMAR_MA_Pos)                  /*!<Memory address*/
#define  DMA_CMAR_MA                              DMA_CMAR_MA_Msk
#define  DMA_CMAR_MA_0                            (0x00000001U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_1                            (0x00000002U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_2                            (0x00000004U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_3                            (0x00000008U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_4                            (0x00000010U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_5                            (0x00000020U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_6                            (0x00000040U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_7                            (0x00000080U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_8                            (0x00000100U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_9                            (0x00000200U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_10                           (0x00000400U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_11                           (0x00000800U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_12                           (0x00001000U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_13                           (0x00002000U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_14                           (0x00004000U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_15                           (0x00008000U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_16                           (0x00010000U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_17                           (0x00020000U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_18                           (0x00040000U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_19                           (0x00080000U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_20                           (0x00100000U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_21                           (0x00200000U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_22                           (0x00400000U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_23                           (0x00800000U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_24                           (0x01000000U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_25                           (0x02000000U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_26                           (0x04000000U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_27                           (0x08000000U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_28                           (0x10000000U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_29                           (0x20000000U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_30                           (0x40000000U << DMA_CMAR_MA_Pos) 
#define  DMA_CMAR_MA_31                           (0x80000000U << DMA_CMAR_MA_Pos) 

#endif

